# Data Manipulation and Analysis LOCALLY

In [1]:
import pandas as pd
df=pd.read_csv('0data.csv')
## fetch the first 5 rows
df.head(5)
# df.tail(5) #last 5, ascending only
# df.describe()
# df.dtypes

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

### Handling Missing Values

In [2]:

# print(df.isnull()) #prints entire
df.isnull().any() #only the missing value row

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [3]:
df.isnull().sum() #true=1 & f=0. basically sum of values 
                  #     ,there are 4 missing in 'Sales'
# print(df.fillna(0)) #temporary
# df=df.fillna(0) #for permanent

# a new column with filled values of sales
# df['Sales_fillNA']=df['Sales'].fillna(df['Sales'].mean())

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

### Changing datatypes/Column Info

In [4]:
# Renaming Columns
df=df.rename(columns={'Sales':'Sales Date'})
df.head()
# change datatypes
df['Value_new']=df['Value'].fillna(df['Value'].mean()).astype(int)

# Manipulating column wise data (element wise result)
df['Value']=df['Value'].apply(lambda x:x*2)

### Data Aggragating

In [5]:
grouped_mean=df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1     92.428571
Product2    105.600000
Product3    110.333333
Name: Value, dtype: float64

In [6]:
grouped_sum=df.groupby(['Product','Region'])['Value'].sum()
print(grouped_sum)

Product   Region
Product1  East      584.0
          North      18.0
          South     200.0
          West      492.0
Product2  East      112.0
          North     254.0
          South     362.0
          West      856.0
Product3  East      404.0
          North     406.0
          South     430.0
          West      746.0
Name: Value, dtype: float64

In [7]:
# aggregate multiple functions
groudped_agg=df.groupby('Region')['Value'].agg(['mean','sum','count'])
groudped_agg

              mean     sum  count
Region
East     84.615385  1100.0     13
North    75.333333   678.0      9
South   124.000000   992.0      8
West    123.176471  2094.0     17

In [8]:
### Merging and joining Dataframes
# Create sample DataFrames
df1 = pd.DataFrame({'Key': ['A', 'B', 'C'], 'Value1': [1, 2, 3]})
df2 = pd.DataFrame({'Key': ['A', 'B', 'D'], 'Value2': [4, 5, 6]})

In [9]:
## Merge Datafranme on the 'Key Columns'
pd.merge(df1,df2,on="Key",how="inner")
# pd.merge(df1,df2,on="Key",how="outer")
# pd.merge(df1,df2,on="Key",how="left")
# pd.merge(df1,df2,on="Key",how="right")

  Key  Value1  Value2
0   A       1       4
1   B       2       5

# Data Manipulation/Analysis EXTERNALLY

### Reading from a website

In [10]:
df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)
df.head()

# saving the fetched data into a local file
df.to_csv("0wine.csv")

### Reading HTML of websites

In [11]:
# !pip3 install lxml --break-system-packages
# !pip3 install html5lib --break-system-packages
# !pip3 install beautifulsoup4 --break-system-packages

In [12]:
url="https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"

df=pd.read_html(url)
df[0]

# url="https://en.wikipedia.org/wiki/Mobile_country_code"
# pd.read_html(url,match="Country",header=0)[0]

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
1,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
2,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
3,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
4,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
5,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
6,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
7,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
8,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
9,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536

### Working with xlsx files

In [13]:
# !pip3 install openpyxl --break-system-packages
# for xlsx files

In [14]:
df_excel=pd.read_excel('0data.xlsx')

In [15]:
df_excel.to_pickle('df_excel')
pd.read_pickle('df_excel')

    Name  Age
0  Krish   32
1   Jack   34
2   John   31